[
{
	"review": "I purchased a similar model of vacuum overseas, which was about the same cost and so light & easy to use with its own charging stand and great performance. So it encouraged me to purchase one for home as my Dyson which I love, is now becoming a little too heavy to take up & down stairs and generally cart around the house. As this was on special offer I thought it was worth it. My rating reflects the weight and ease of use. Cons: Much heavier than I'd like, and very top heavy when using. I'm also not keen on the articulation of the brush head, which seems to have a mind of its own, so I struggle to keep it straight, when I need to. Also emptying the bin is tricky as i need to use both hands to press a clip on each side to open the container...not easy for older hands, and when using the hand vac on the stairs it is a bit cumbersome and again also heavier than I'd like. Won't stand upright on its own when fully extended so need to lean it against furniture/wall etc. Pros: I like the two options for suction which work efficiently enough, and I like the fold down design, so it does take up a very small footprint. I Like the detachable hand vac (even though its heavy) it has a good assortment of attachments and the battery life is very good, easy 40 mins on full charge. To be honest if I hadn't used it I would have returned it, but too late now.",
	"summary": "It performs well, but is heavier and top-heavy than desired. The brush head articulation is problematic, and emptying the bin requires both hands. The hand vac is cumbersome, and it doesn't stand upright when fully extended. The two suction options are efficient, and the fold-down design is compact. The detachable hand vac has good battery life and attachments. The reviewer would have returned it if given the chance."
},
{
	"review": "I've been saving my pennies for a new cordless vac for a long time. Everyone has been raving about Shark so I did my research and made my choice and then waited excitedly. I paid almost £60 in extra duty buying from the UK as they're not readily available in Europe. My vacuum didn't arrive on the expected day, or the next, in fact it never arrived, so I had to order it again and wait again. The vacuum overall is ok. The folding storage system is fiddly (and hard to plug in the charger when it's upside down in storage mode) as is the removal and clipping back in of the dust box. It's not picking up all the crumbs etc immediately, I have to go over and over it. It's quite heavy on the arm too and very top heavy. Positives- the carpet function seems to be very good (although we have mainly all tiled floors) and so far the battery seems to be holding well.",
	"summary": "The vacuum is okay but has fiddly folding storage and dust box removal. It requires multiple passes to clean effectively and is heavy and top-heavy. The carpet function and battery performance are positives."
},
{
	"review": "We purchased this product for my partner who is now working from home. She wanted a stick hoover to be able to clean the room each day after work. We received this product late last night ( 26/03/23 ) and unbowed it. We initially had good thoughts of the hoover after hoovering one room. We then disconnected the pipe to add an attachment. After attempting to reconnect the pipe and main floor head, all of a sudden the lights at the front and the brush were not working in the head. We have sat and fiddled with this item for approx 30 minutes taking care to ensure everything was clean and connected properly to make sure there was no user error. However there wasn't. It was apparent the head was no longer receiving any electricity from the main unit. We started a refund and have sent back the item. In addition to this, the item is flimsy, cheaply made, has a loud brush that spins, and has an extremely small capacity. Don't waste your money, buy something else.",
	"summary": "The vacuum was purchased for daily cleaning but encountered issues after disconnecting the pipe. Lights and brush in the head stopped working despite troubleshooting. The item was returned due to poor quality, loud brush, and small capacity. Not recommended."
},
{
	"review": "This hover is very light, its free standing to charge in an upright positionwith provided plugs. The hoover breaks down to 3 sections and comes with several good attachments smaller heads and narrow pipe head etc the main pipe is height adjustable which is a great feature to have, the main head it low profile and easily gets under sofas etc. Easy to dismantle and clean out, with the dust filter having a thin sheet around it joined with velcro for easy removal and seems to work very well. The Bad : No options for wall hanging. The hoover has to be used in turbo mode constantly as the suction is abismal we have hard floors with carpet on the stairs and landing and it cant remover the dog hair effectivley from the carpet or any mud etc larger than 2 mill on any surface. The brushes on the main head have 2 types soft and stiff the stiff ones are too short to pull any dirt up and the soft ones seem too soft to work well on any surface even on turbo. This results in the batery only lasting about 10-15 mins which is not ideal. The clips to open the dirt container don't seem very robust nor do the ones on the join between the shaft and the main body, the one to connect the main shaft with suction head should have a tab that can be realeased with you're foot rather than groveling on the floor to hald a tab in and tugging the head off. After cleaning the filters and waste out its very fiddly to re-attach. This item has some good features on it but I'd not buy another as the suction is soooo very poor and thats its primary funtion after all.",
	"summary": "The vacuum is lightweight and comes with useful attachments. It has adjustable height, a low-profile head, and easy-to-clean filters. However, it lacks wall-hanging options and has weak suction, especially for pet hair and larger debris. The battery lasts only 10-15 minutes, and the clips and connections are not robust. Overall, not recommended due to poor suction."
},
{
	"review": "I use this to vaccum my whole apartment which includes the Kitchen floor, Bathroom, Living Room, and 2 Bedrooms. I found the suction to be sufficient to clean both carpet and lvt floors and the roller works well to catch anything it can. The weight is lighter than I expected considering that it houses a battery and the battery itself allows me to vacuum all my rooms on high power. Waste disposal is very easy and I find that the dust tries to clump up making it even easier to empty. Can't find anything to complain about in all honesty, highly recommended",
	"summary": "The vacuum is used to clean multiple rooms with sufficient suction on different floor types. It is lightweight and has a powerful battery for extended cleaning. Easy waste disposal. Overall, highly recommended with no complaints."
},
{
	"review": "This is the first cordless hoover I have had and it is lovely not having the wire get in the way and the constant moving of the plug. The charge is ok it's enough to do the whole house. We have got in the habit of charging straight after use or it can be frustrating if you forget and go to Hoover and the batter is dead. It takes a few hours to charge. I have had a couple of issues one with the charger and one with the hoover but I contacted Planet Express and they were extremely helpful and sent replacement parts. This is really important for me knowing if there are problems the company will resolve it and someone will reply to my contact. I would recommend this hoover",
	"summary": "The cordless vacuum provides freedom from wires and has a sufficient charge for the whole house. Charging immediately after use is necessary to avoid frustration. The company's excellent customer service resolves any issues promptly. Overall, highly recommended."
},
{
	"review": "Always dubious about how good cordless hoovers are, but this has taken me completely by surprise, had to buy lighter hoover due to health issues, researched for 3+ days before deciding on this one. Great hoover so glad I did. I also have long hair which can be a problem for some hoovers, whilst this doesn't have anti wrap, it's so easy to clean off. The level of suction on the lowest setting is more than ample to cope with long hair and day to day crumbs etc. Fantastic little find.",
	"summary": "The cordless vacuum exceeded expectations and was a great choice for lighter use. It effectively handles long hair and day-to-day debris with ample suction on the lowest setting. A fantastic find."
},
{
	"review": "This hoover gets blocked with anything bigger than dust. Suction power is poor even on maximum of power. Will replace it soon. Update: they did not like my comments and offered me a refund or voucher if I changed my review or deleted it. So I changed it from a 2 star to a 1 star and did not take them up on their offer. I quite often rely on reviews and am horrified that it can be changed for money.",
	"summary": "The vacuum gets easily clogged and has poor suction, even on maximum power. The reviewer plans to replace it soon. They received an offer to change or delete their negative review in exchange for a refund or voucher, but declined, expressing concern about the integrity of reviews being influenced by monetary incentives."
},
{
	"review": "Ok so when you get it out of the box it all looks pretty good. We liked the fact that it had a power display and several power settings. The lance was a good design as well. Also liked the fact that when you pressed the trigger you don't need to keep your finger on it. So we charged it up and off we went, or rather we didn't. We ran it over a rug that took our old vacuum about a minute to thoroughly clean. After 5 minute with this thing we gave up, put it back in the box and returned it. The rug still had lots of bits on it and clearly this vacuum (on max power) couldn't deal with it. We bought this after reading many good reviews. This is absolutely rubbish and the only recommendation I can give is don't buy it.",
	"summary": "The vacuum cleaner has a sleek design with a power display and multiple settings. The trigger does not require constant pressure. However, it failed to effectively clean a rug, even on maximum power. Despite positive reviews, it was returned due to poor performance. Overall, it is not recommended for purchase."
},
{
	"review": "Ordered this expecting that it was great quality vacuum cleaner, but…. I was really disappointed when I received my order. The vacuum cleaner was already used by somebody else it had all the dust inside, the stickers was teared off the battery was completely dead, takes 4hrs to fully charge it and it runs out really quick. Very disappointing purchase. Luckily, returned this vacuum cleaner back and got my refund back as well. Would not recommend this item to anyone.",
	"summary": "The vacuum cleaner arrived used with dust inside, damaged stickers, and a dead battery. It took 4 hours to charge and had a short runtime. The reviewer returned it and advises against purchasing."
},
{
	"review": "Our main brand cordless vacuum cleaner was having issues. This vacuum cleaner seemed better than average cordless vacuum cleaner. Thought to try it out. I and my family members are impressed by this machine. It’s light enough and nimble. Even on low suction mode it picks up all the dust and sand. At high suction mode it is very powerful but battery will drain a bit quicker. Only real negative I found compared with our previous branded cordless cleaner is a station with all the bits and pieces on. This one only comes with a piece of plastic where the vacuum cleaner with long brush attachment would lean on. So we have to get a box to have all the smaller bits together. Still 5stars from better. Very good value vs performance. 3 year warranty has been activated as well. Recommended.",
	"summary": "The vacuum cleaner exceeded expectations, being lighter and more nimble than the reviewer's previous branded cordless cleaner. It effectively picks up dust and sand on low suction and has powerful performance on high suction. The only drawback is the lack of a proper storage station for attachments. Overall, it is highly recommended for its value, performance, and activated 3-year warranty."
},
{
	"review": "I got this as I couldn't afford a higher end vacuum and am pleasantly surprised by how useful it is. It's extremely light and has lots of functions to get into different spaces. The downside is that the battery only lasts about half an hour and the tank fills up quickly, so it's better for a small home.",
	"summary": "The affordable vacuum exceeded expectations with its light weight and versatile functions. However, the battery life is limited to about half an hour, and the tank fills up quickly, making it more suitable for smaller homes."
},
{
	"review": "This is as good as suction as my gtech handheld i had as a package before is packed in. So I replaced it with this product..the battery won't last you as long as the expensive brands possibly but the suction is as good as any others. The only thing so far after a couple of times using it the settings are the suction starts at lowest setting and you have to swipe to get the power up .It would be best tobe on full suction as default and reduce power where required for more delicate jobs and save battery life but you would find yourself turning it up full every time. The bracket for wall mounting is awful..after mounting on wall the hoover would of fallen straight off..it will attach but a little finger push would have ot fall to the floor so beware..iv left mine on utility room surface instead..not as space saving but nice and safe. Impressed with the vacuum itself so far though.",
	"summary": "This vacuum offers comparable suction to expensive brands but has a shorter battery life. The default suction starts at the lowest setting, and the wall mounting bracket is not secure. Overall, it performs well, but the bracket and default settings could be improved."
},
{
	"review": "I just love love love this vacuum cleaner it is very lightweight my floors have never been so clean I think I'm getting brownie points with my partner she does not live with me she came today she said I've never seen your floors so clean then I present her with my new vacuum cleaner more brownie points but more on a serious note this is a fantastic vacuum cleaner it's so handy just to unclip it off the wall and Hoover up I used to hate using my vacuum cleaner the wires getting caught all over the place I like to keep my floors clean so when there is a bit of dust on the floor I just unclip Hoover and back on the wall so handy so easy I do not live in a big massive house so the battery will last me a few days before having to charge it up again I can honestly say I now enjoy hoovering up oh my God what is wrong with me well that's what my partner says so I am considering buying my partner one of these vacuum cleaners I should have got one years ago and I doubt if I will ever go back to a corded vacuum cleaner is not the most powerfulest suction but is powerful enough to do carpets and laminated floors and the light on the front is so handy it lights up and show you where the dust is where you would not normally see it as I said before I just love this vacuum cleaner and for the price that you buy it for you cannot go wrong why get a unbelievably expensive vacuum cleaner that does the same job as this one I don't like calling it a cheaper version because it is such a good hoover take my advice if you want a not so expensive vacuum cleaner get this one trust me you will not be disappointed and it is a Hoover.so it is a good reliable make .Happy hoovering all you men out there .get them brownie point's from her indoors.the only thing I don't like is it takes so long to charge the battery up .but if you live in a small home then there is enough battery to do the job.but for a big home and it runs out of power .then you would have to wait a hour or so to wait for the battery to fully charge. If that was the case. Then it would be worth getting a 2nd battery.",
	"summary": "This lightweight vacuum cleaner is highly praised for its convenience and effectiveness. It provides sufficient suction for carpets and laminated floors, with a helpful front light. The long charging time is a downside, especially for larger homes. Consider purchasing a second battery. Overall, it's a reliable and affordable option."
},
{
	"review": "*EDIT - After months of use I still stick by my original review, however... I have a serious peeve with the filter. I've come to realise there is no way to empty this vacuum cleanly. Because the filter gathers hair and dust this clumps around the barrel and makes emptying the bin a messy ordeal. You have to remove the filter by hand when emptying the bin to ensure everything is out and end up with a hand that looks like it has been dipped in an urn! For that I've taken away 2 stars from my review.* Having previously owned two cordless Dysons I was looking for something different as I felt both had design flaws and weren't worth the hundreds of pounds price tags. Knowing Hoover to be a good old fashioned brand and reading multiple positive reviews I thought I'd take a chance as the price seemed very reasonable too. Well I'm glad I did! Much smoother than my Dysons, better suction, lightweight and I find I'm now happy to whip the vacuum around rather than getting frustrated at the lack of suction and constant up keep. The on board tools are also a huge bonus as I was getting fed up of being back and forth for the tools on my old model. Also love the little lights. Give it a go!",
	"summary": "This Hoover vacuum cleaner proves to be a worthwhile alternative to more expensive brands. It offers better suction, smoother operation, and convenient on-board tools. However, the filter design makes emptying the bin messy and requires manual removal. Overall, it's a good option at a reasonable price."
},
{
	"review": "Bought as a second vacuum to use in our motorhome. Suction is ok (not as good as maybe some of the more premium/expensive brands) but it meets our needs. It does get dog hair up which is good. Battery life is limited - we got approx 20/25 mins on first use so didn’t quite get finished before it needed a recharge. Takes a long time to recharge - approx 4 hours.",
	"summary": "This vacuum cleaner serves well as a secondary option for motorhome use. While the suction is decent, it falls short compared to pricier brands. It effectively removes dog hair, but the battery life is limited, requiring a recharge after 20-25 minutes. The lengthy 4-hour recharge time is a drawback."
},
{
	"review": "Poor suction and very short battery life (which takes about 8 hours to recharge!). Relatively cheap, so I guess I cannot complain. Feels flimsy and I don't expect it to last very long. It is light and easy to use though. Would be useless for pet hairs. I wouldn't buy again. Spend more and get better quality.",
	"summary": "This vacuum cleaner has poor suction, a short battery life, and a lengthy recharge time. It feels flimsy and lacks durability. However, it is lightweight and easy to use. Not recommended for pet hair. Consider investing in a higher-quality option."
},
{
	"review": "I bought this Hoover as I was finding my main Dyson cleaner rather unwieldy after suffering a broken ankle. It’s got great suction and charges in about six hours. The tools are a little limited, the crevice tool (stored in the underside of the unit) is handy, but rather too short for the gaps I need it for and the small brush is good for dusting off edges of furniture and the like. The main floor attachment is super for both carpet and hard floors, and I was pleasantly surprised how easily it picked up bits of fluff and hair. Some people might find the unit a little heavy using as a hand held on stairs, but overall it’s a great machine and well worth the money. I’ll probably still keep the Dyson for now, but I don’t think it’ll get used so often and this Hoover will be useful for vacuuming out the car too.",
	"summary": "This Hoover offers great suction and a reasonable charging time. The included tools are useful, although the crevice tool may be too short for some gaps. The main floor attachment works well on both carpet and hard floors. It's a bit heavy for handheld use on stairs, but overall it's a worthwhile machine with good value for money. It can also be used for vacuuming cars."
},
{
	"review": "Pleased with speed I can whizz around hoovering, very good suction, no hoover dust smell, although the dust compartment needs emptying of carpet fluff after 15 mins but I bought this to make hoovering stairs easier but it is unwieldy - I hold the bannister with one hand for safety and this hoover in the other but it is heavy for me and the large brush head isn't fixed so its movement and weight make the stairs less risk free than I wanted. The manual (dreadful) has little of help. It states charge for 24 hours before use - wonder how much energy that costs? My problem is it was easy to assemble the hoover stick and large brush on the end, but I can't dismantel them. I want to remove the large brush to make hoovering stairs easier, but nothing now comes apart despite clicking the release button and pulling as instructed. Any advice welcome please to save a return.",
	"summary": "The Hoover provides fast and efficient cleaning with good suction and no odor. However, the dust compartment fills up quickly, and using it on stairs can be difficult and heavy. The lack of clear instructions and inability to dismantle the brush head for easier use is frustrating. Seeking advice to avoid returning it."
},
{
	"review": "The suction is poor. More like a dust brush. Not picking up dirt from the floor. The accessories are a medium quality plastic. Not very durable but will not break on first use either. It is lightweight, easy to manover around. It is mice that has the accessories inside so you can carry them around. The battery is charged separately and it's fairly easy to store it. The hair will wrap around the brush ( if it happens to pick any as the suction is a bit rubbish) . Even with the tool attached will mot pick up small break crumble from first time. It is easy to empty the dust bin, but will not be that easy to wash it. From some thin carpets will pick up more, but for medium to thick carpets will stand no chance. A dust brush will do more. I sent it back to the seller. It says sold by Amazon, but actually is a company named Electrical Experience and their customer service is less than 1 star. I had a lot of trouble returning this. They even called be to tell me that this should be used as a second vaccum for easy jobs like stairs and things like this. Well nowhere is saying that on the description... Also I've been receiving a message from them that made no sense. 2 weeks to issue a lable and still waiting for a refund after 3 weeks of struggles. So be careful!",
	"summary": "The vacuum has poor suction, subpar accessories, and struggles to pick up dirt and hair. It is lightweight and easy to maneuver, but the battery is charged separately. Cleaning the dust bin is manageable, but the vacuum is not effective on thick carpets. Returning the product was a hassle due to poor customer service from the seller. Caution is advised."
},
{
	"review": "This product is nowhere near as good as it claims. 25 minutes of battery power is extremely optimistic. After 10 minutes there is a clear drop off in power. If you have a small flat it may be sufficient but expect to do 10 mins of cleaning followed by 6 hours of charging then another 10 mins of cleaning and repeat and repeat if you plan on cleaning a house. It also gets blocked extremely easily. We returned this and bought a Shark cleaner. There isn't a comparison the Shark picked up large amounts that this cleaner had missed. Dont waste your money on this buy something from another brand.",
	"summary": "The product falls short of its claims with optimistic battery life and a drop in power after 10 minutes. It's suitable for small spaces but requires frequent recharging and gets easily blocked. A Shark cleaner proved more effective. Consider alternatives from different brands."
},
{
	"review": "Well where do I start as there so much wrong with this hoover branded cordless. I’m firstly shocked that hoover allowed it to have its logo on such a poor vacuum. The design is bulky very top heavy for those who are elderly and the suction power is practically none existent I could suck in myself more powerfully and I’ve been on 20 year 20 pack a day habit. PThe 25 min run time I disagree it’s more like 15 and although dysons earlier models ran at 6mins on full power that was all that was needed due to the few passes needed to pick up large amounts dust/debris due to its suction power. I still own a dyson v59 animal but this had flaws with its bin splitting were you insert the tools so after my fifth bin at £21 a pop I saw this. I So wish I hadn’t. Unfortunately like the review I saw saying it was a free gift in return for a honest review I wish I had been given this luxury instead of parting with my hard earned money. The bin on this hoover is large as stated but still you have the problem of clicking the button and nothing falls out as it’s all wrapped and wedged between the inner bin and internal components but this will be after months of hoovering due to its poor pick up of dust/debris . My dyson with brush bar attachment lifts the pile of my carpet and same with the brush tool for stairs & soft furnishings you can see every pass I make but this hoover model just glides around you can feel no resistance as the suction is so weak and the pile remains flat. There’s no option to lower the brush bar or either a boost mode you get what it produces a whole lot of nothing-ness & the on board crevice tool that’s even a bigger joke it fits within the handle which you lift a clipped down cover which is fiddly to get out and hard to unlatch the lid. It is the shortest crevice tool I’ve seen the open end is so narrow a grain of rice would block up the crack I’ve never seen a crevice tool as small ,thin and the crack so narrow it is also useless to get down the sides of car seats as it’s too short once on the bulky head of the cleaner. Removing the long shaft to make it handheld for crumbs on work tops etc is not easy either and the slide down brush is stiff to get it to the end of the nozzle to use as handheld then this has a massive opening with thick bristles all around the outer edge and all the same length that when used it simply pushes the bits/crumbs/dust away on the floor with nothing actually getting sucked up. If you put your hand over to feel the suction power you will be so disappointed. It’s shocking why did I choose this model. I hope to make sure others don’t make the same mistake. My sister as just purchased a vax model with a plus-minus button on the handle for suction power & wow it’s better than dyson and even on the lowest bar of her vax cordless the suction is more powerful than this bulky useless hoover model. Do I need the hassle of returning no I will give it away to a local charity shop and hopefully after using this and reviewing it I can make other would be buyers more knowledgeable and hopefully choose a different brand. Please don’t waste your time & money on this cordless. I’ve tried uploading a few images one of which is the pathetic little crevice tool but for some reason I’m unable to see this option on my edit. Anyway I’ve measured my dyson crevice tool once clicked into the machine and it’s 21cm 8.5 inches in total this gets well into crevices like car seats etc.Now the crevice tool on this hoover 8cm 3.5 inches and the narrow crevice opening length of 1 inch compared to just under 2 inch on dyson with a much wider width enough for larger debris to suck into the bin and like I stated above a grain of rice would Block this crevice tool due to the narrow width.",
	"summary": "The Hoover cordless vacuum receives heavy criticism for its poor suction power, bulky design, and short battery life. The crevice tool is deemed useless, the bin is difficult to empty, and the overall performance falls far behind Dyson and other brands. Consider alternative options to avoid disappointment."
},
{
	"review": "Sad news I'm afraid. This little hoover is not good if you want clean floors. It is more of a carpet tickler than a vacuum cleaner. Suction is poor and greatly reduces over time. We have had ours 4 months and I'm giving up with it. Things quickly get blocked in its bendy tubes so there's a lot of trouble shooting and poking of sticks in to the tube to try and clear it before you can use it. Hoover helpline is helpful but I'd rather just have a vacuum that works with no fuss. The catch snapped on our dust bin but it's £26 to replace which is mad. I'm going to put that £26 towards a Shark because I know they work.",
	"summary": "The Hoover cordless vacuum disappoints with its weak suction, prone to blockages, and unreliable dust bin catch. Troubleshooting is frequent, and replacement parts are expensive. Consider investing in a more reliable brand like Shark."
},
{
	"review": "Even from the beginning I did not find the suction on this vacuum cleaner very good. It was fine on my hard floors, but on the stairs and on carpet the suction was not strong enough. After every clean I had to sit down with small scissors and cut away all the hair that had wrapped itself tightly around the roller in the head. Then after two years it stopped sucking the the head on so I thought the head must be damaged and tried to order that part. The part was not in stock so I waited for 2 months and then cancelled the order and bought a new vacuum cleaner. Very disappointing for such a well known brand!",
	"summary": "The Hoover vacuum cleaner lacks strong suction, particularly on stairs and carpets. Hair wrapping around the roller is a constant issue, and a malfunctioning head added to the frustration. Disappointing performance from a reputed brand."
},
{
	"review": "Lightweight, good suction, effective roller head, does a great job on our rugs. Picks up everything I'd expect a vacuum to collect. Comes with one extra HEPA filter; hopefully, cleaning the metal prefilter often will help the HEPAs last. Easy to assemble. Easy to recharge. Easy to empty. Easy to clear my hair off the roller, without taking anything apart so it doesn't matter that it lacks a 'hair wrap' feature. Headlight is surprisingly helpful. Also love that the vacuum will stand on its own at the side of the room, poised and ready. The height is a tad short for my 6-foot husband, except for doing the stairs, but it's fine for me. Ooh, wait--it does extend! Wonderful. Quiet, too, so we can use it late or early without waking anyone next door. I hope this lasts a long time!",
	"summary": "The lightweight Hoover vacuum offers good suction, effective roller head, and easy maintenance. It excels at picking up debris and includes helpful features like a headlight and self-standing design. The height may be a slight drawback for taller users. Overall, a quiet and promising vacuum."
},
{
	"review": "We have been using my father's old GTech Air ram for some time for the smaller jobs around the house particularly hoovering around the table and the rug, but needed something handheld to get up small accidents especially now we have a very inquisitive puppy, this does that and beyond it picks up her fur off the rug better than the gtech did and only problem is that it can get clogged easily but its easy to clear and charges well and does the job too.",
	"summary": "The handheld vacuum is great for small jobs and picking up pet fur. It outperforms the GTech Air Ram on rugs but can get clogged easily. Good charging and effective cleaning overall."
},
{
	"review": "The suction power is more sound then follow through. It does pick up most but definitely not all. It barely looks like I’ve vacuumed. I was disappointed, especially after reading the reviews. If you live alone with no pets and have either new carpets or hard surface flooring, then this is a great budget vacuum for you. Unfortunately, for everyone else, this is money that could have gone toward a more effective product. It’s just too bad that those brands cost so much. I should say, I was impressed with the battery life.",
	"summary": "The vacuum has moderate suction power but leaves behind noticeable dirt. It's suitable for single individuals without pets and new flooring. Battery life is good, but overall effectiveness is lacking."
},
{
	"review": "Glad I bought this but still need my old hoover.. Positives: 1.Easy to assemble, quick start 2. Lightweight and flattens out for under furniture cleaning 3. Once charged, battery power good for 30 mins. Great to not need plug in 4. Powerful on difficult to reach places, nooks and crannies Negatives: 1. Wood / flat floors only. Upright mode does not have suction power to vacuum carpets/rugs 2. Gets clogged up easily.. can’t cope with pet hair/fluff 3. Move from one level to another (eg, down a step) all dust spits out again whether switched on or off. 4. Have to empty frequently. (Twice per 30 mins standard clean).",
	"summary": "This vacuum is convenient and lightweight, but limited to cleaning wood or flat floors. It struggles with pet hair, gets easily clogged, and has issues with transitioning between surfaces."
},
{
	"review": "On full charge you need to have this on the highest power to pick up which means the charge runs out very quickly. I brought this for my mum with Parkinson’s thinking it would be ideal but unfortunately I have only just visited her so I’m over my return period otherwise it would have been going straight back!",
	"summary": "The vacuum's short battery life and weak suction on lower power settings make it inconvenient. Not suitable for users with specific needs, and missed the return window."
},
{
	"review": "Worst part is the charging time and usage on high speed. Charging time: almost 4hours (from zero) using the charger given in the box. Usage time (on full speed): 12 to 15 min MAX. Works ok on hard surface with single speed, however carpets needs max speed. Good fit for small area.",
	"summary": "The vacuum's long charging time and short usage time on high speed are major drawbacks. Works well on hard surfaces but requires maximum speed for carpets. Suitable for small areas."
},
{
	"review": "The vacuum is light so don’t expect a feeling of deep clean however I am very satisfied with the results and the handheld part is so good on the stair. One major thing to highlight the brush head is advertised as being motorised however after a couple of tries the brush only worked spasmodically. I emailed the company and within one day had a reply informing me that they were sending a replacement I was amazed and true to their word the new machine arrived in 3 days. Fantastic service I would recommend it.",
	"summary": "The vacuum is lightweight and performs well, especially the handheld part on stairs. However, the motorized brush head had issues, but the company provided excellent customer service by promptly replacing the machine. Recommended."
}
]