[
{
	"review": "I purchased a similar model of vacuum overseas, which was about the same cost and so light & easy to use with its own charging stand and great performance. So it encouraged me to purchase one for home as my Dyson which I love, is now becoming a little too heavy to take up & down stairs and generally cart around the house. As this was on special offer I thought it was worth it. My rating reflects the weight and ease of use. Cons: Much heavier than I'd like, and very top heavy when using. I'm also not keen on the articulation of the brush head, which seems to have a mind of its own, so I struggle to keep it straight, when I need to. Also emptying the bin is tricky as i need to use both hands to press a clip on each side to open the container...not easy for older hands, and when using the hand vac on the stairs it is a bit cumbersome and again also heavier than I'd like. Won't stand upright on its own when fully extended so need to lean it against furniture/wall etc. Pros: I like the two options for suction which work efficiently enough, and I like the fold down design, so it does take up a very small footprint. I Like the detachable hand vac (even though its heavy) it has a good assortment of attachments and the battery life is very good, easy 40 mins on full charge. To be honest if I hadn't used it I would have returned it, but too late now.",
	"summary": "It performs well, but is heavier and top-heavy than desired. The brush head articulation is problematic, and emptying the bin requires both hands. The hand vac is cumbersome, and it doesn't stand upright when fully extended. The two suction options are efficient, and the fold-down design is compact. The detachable hand vac has good battery life and attachments. The reviewer would have returned it if given the chance."
},
{
	"review": "I've been saving my pennies for a new cordless vac for a long time. Everyone has been raving about Shark so I did my research and made my choice and then waited excitedly. I paid almost £60 in extra duty buying from the UK as they're not readily available in Europe. My vacuum didn't arrive on the expected day, or the next, in fact it never arrived, so I had to order it again and wait again. The vacuum overall is ok. The folding storage system is fiddly (and hard to plug in the charger when it's upside down in storage mode) as is the removal and clipping back in of the dust box. It's not picking up all the crumbs etc immediately, I have to go over and over it. It's quite heavy on the arm too and very top heavy. Positives- the carpet function seems to be very good (although we have mainly all tiled floors) and so far the battery seems to be holding well.",
	"summary": "The vacuum is okay but has fiddly folding storage and dust box removal. It requires multiple passes to clean effectively and is heavy and top-heavy. The carpet function and battery performance are positives."
},
{
	"review": "We purchased this product for my partner who is now working from home. She wanted a stick hoover to be able to clean the room each day after work. We received this product late last night ( 26/03/23 ) and unbowed it. We initially had good thoughts of the hoover after hoovering one room. We then disconnected the pipe to add an attachment. After attempting to reconnect the pipe and main floor head, all of a sudden the lights at the front and the brush were not working in the head. We have sat and fiddled with this item for approx 30 minutes taking care to ensure everything was clean and connected properly to make sure there was no user error. However there wasn't. It was apparent the head was no longer receiving any electricity from the main unit. We started a refund and have sent back the item. In addition to this, the item is flimsy, cheaply made, has a loud brush that spins, and has an extremely small capacity. Don't waste your money, buy something else.",
	"summary": "The vacuum was purchased for daily cleaning but encountered issues after disconnecting the pipe. Lights and brush in the head stopped working despite troubleshooting. The item was returned due to poor quality, loud brush, and small capacity. Not recommended."
},
{
	"review": "This hover is very light, its free standing to charge in an upright positionwith provided plugs. The hoover breaks down to 3 sections and comes with several good attachments smaller heads and narrow pipe head etc the main pipe is height adjustable which is a great feature to have, the main head it low profile and easily gets under sofas etc. Easy to dismantle and clean out, with the dust filter having a thin sheet around it joined with velcro for easy removal and seems to work very well. The Bad : No options for wall hanging. The hoover has to be used in turbo mode constantly as the suction is abismal we have hard floors with carpet on the stairs and landing and it cant remover the dog hair effectivley from the carpet or any mud etc larger than 2 mill on any surface. The brushes on the main head have 2 types soft and stiff the stiff ones are too short to pull any dirt up and the soft ones seem too soft to work well on any surface even on turbo. This results in the batery only lasting about 10-15 mins which is not ideal. The clips to open the dirt container don't seem very robust nor do the ones on the join between the shaft and the main body, the one to connect the main shaft with suction head should have a tab that can be realeased with you're foot rather than groveling on the floor to hald a tab in and tugging the head off. After cleaning the filters and waste out its very fiddly to re-attach. This item has some good features on it but I'd not buy another as the suction is soooo very poor and thats its primary funtion after all.",
	"summary": "The vacuum is lightweight and comes with useful attachments. It has adjustable height, a low-profile head, and easy-to-clean filters. However, it lacks wall-hanging options and has weak suction, especially for pet hair and larger debris. The battery lasts only 10-15 minutes, and the clips and connections are not robust. Overall, not recommended due to poor suction."
},
{
	"review": "I use this to vaccum my whole apartment which includes the Kitchen floor, Bathroom, Living Room, and 2 Bedrooms. I found the suction to be sufficient to clean both carpet and lvt floors and the roller works well to catch anything it can. The weight is lighter than I expected considering that it houses a battery and the battery itself allows me to vacuum all my rooms on high power. Waste disposal is very easy and I find that the dust tries to clump up making it even easier to empty. Can't find anything to complain about in all honesty, highly recommended",
	"summary": "The vacuum is used to clean multiple rooms with sufficient suction on different floor types. It is lightweight and has a powerful battery for extended cleaning. Easy waste disposal. Overall, highly recommended with no complaints."
},
{
	"review": "This is the first cordless hoover I have had and it is lovely not having the wire get in the way and the constant moving of the plug. The charge is ok it's enough to do the whole house. We have got in the habit of charging straight after use or it can be frustrating if you forget and go to Hoover and the batter is dead. It takes a few hours to charge. I have had a couple of issues one with the charger and one with the hoover but I contacted Planet Express and they were extremely helpful and sent replacement parts. This is really important for me knowing if there are problems the company will resolve it and someone will reply to my contact. I would recommend this hoover",
	"summary": "The cordless vacuum provides freedom from wires and has a sufficient charge for the whole house. Charging immediately after use is necessary to avoid frustration. The company's excellent customer service resolves any issues promptly. Overall, highly recommended."
},
{
	"review": "Always dubious about how good cordless hoovers are, but this has taken me completely by surprise, had to buy lighter hoover due to health issues, researched for 3+ days before deciding on this one. Great hoover so glad I did. I also have long hair which can be a problem for some hoovers, whilst this doesn't have anti wrap, it's so easy to clean off. The level of suction on the lowest setting is more than ample to cope with long hair and day to day crumbs etc. Fantastic little find.",
	"summary": "The cordless vacuum exceeded expectations and was a great choice for lighter use. It effectively handles long hair and day-to-day debris with ample suction on the lowest setting. A fantastic find."
},
{
	"review": "This hoover gets blocked with anything bigger than dust. Suction power is poor even on maximum of power. Will replace it soon. Update: they did not like my comments and offered me a refund or voucher if I changed my review or deleted it. So I changed it from a 2 star to a 1 star and did not take them up on their offer. I quite often rely on reviews and am horrified that it can be changed for money.",
	"summary": "The vacuum gets easily clogged and has poor suction, even on maximum power. The reviewer plans to replace it soon. They received an offer to change or delete their negative review in exchange for a refund or voucher, but declined, expressing concern about the integrity of reviews being influenced by monetary incentives."
},
{
	"review": "Ok so when you get it out of the box it all looks pretty good. We liked the fact that it had a power display and several power settings. The lance was a good design as well. Also liked the fact that when you pressed the trigger you don't need to keep your finger on it. So we charged it up and off we went, or rather we didn't. We ran it over a rug that took our old vacuum about a minute to thoroughly clean. After 5 minute with this thing we gave up, put it back in the box and returned it. The rug still had lots of bits on it and clearly this vacuum (on max power) couldn't deal with it. We bought this after reading many good reviews. This is absolutely rubbish and the only recommendation I can give is don't buy it.",
	"summary": "The vacuum cleaner has a sleek design with a power display and multiple settings. The trigger does not require constant pressure. However, it failed to effectively clean a rug, even on maximum power. Despite positive reviews, it was returned due to poor performance. Overall, it is not recommended for purchase."
},
{
	"review": "Ordered this expecting that it was great quality vacuum cleaner, but…. I was really disappointed when I received my order. The vacuum cleaner was already used by somebody else it had all the dust inside, the stickers was teared off the battery was completely dead, takes 4hrs to fully charge it and it runs out really quick. Very disappointing purchase. Luckily, returned this vacuum cleaner back and got my refund back as well. Would not recommend this item to anyone.",
	"summary": "The vacuum cleaner arrived used with dust inside, damaged stickers, and a dead battery. It took 4 hours to charge and had a short runtime. The reviewer returned it and advises against purchasing."
},
{
	"review": "Our main brand cordless vacuum cleaner was having issues. This vacuum cleaner seemed better than average cordless vacuum cleaner. Thought to try it out. I and my family members are impressed by this machine. It’s light enough and nimble. Even on low suction mode it picks up all the dust and sand. At high suction mode it is very powerful but battery will drain a bit quicker. Only real negative I found compared with our previous branded cordless cleaner is a station with all the bits and pieces on. This one only comes with a piece of plastic where the vacuum cleaner with long brush attachment would lean on. So we have to get a box to have all the smaller bits together. Still 5stars from better. Very good value vs performance. 3 year warranty has been activated as well. Recommended.",
	"summary": "The vacuum cleaner exceeded expectations, being lighter and more nimble than the reviewer's previous branded cordless cleaner. It effectively picks up dust and sand on low suction and has powerful performance on high suction. The only drawback is the lack of a proper storage station for attachments. Overall, it is highly recommended for its value, performance, and activated 3-year warranty."
},
{
	"review": "I got this as I couldn't afford a higher end vacuum and am pleasantly surprised by how useful it is. It's extremely light and has lots of functions to get into different spaces. The downside is that the battery only lasts about half an hour and the tank fills up quickly, so it's better for a small home.",
	"summary": "The affordable vacuum exceeded expectations with its light weight and versatile functions. However, the battery life is limited to about half an hour, and the tank fills up quickly, making it more suitable for smaller homes."
},
{
	"review": "This is as good as suction as my gtech handheld i had as a package before is packed in. So I replaced it with this product..the battery won't last you as long as the expensive brands possibly but the suction is as good as any others. The only thing so far after a couple of times using it the settings are the suction starts at lowest setting and you have to swipe to get the power up .It would be best tobe on full suction as default and reduce power where required for more delicate jobs and save battery life but you would find yourself turning it up full every time. The bracket for wall mounting is awful..after mounting on wall the hoover would of fallen straight off..it will attach but a little finger push would have ot fall to the floor so beware..iv left mine on utility room surface instead..not as space saving but nice and safe. Impressed with the vacuum itself so far though.",
	"summary": "This vacuum offers comparable suction to expensive brands but has a shorter battery life. The default suction starts at the lowest setting, and the wall mounting bracket is not secure. Overall, it performs well, but the bracket and default settings could be improved."
},
{
	"review": "I just love love love this vacuum cleaner it is very lightweight my floors have never been so clean I think I'm getting brownie points with my partner she does not live with me she came today she said I've never seen your floors so clean then I present her with my new vacuum cleaner more brownie points but more on a serious note this is a fantastic vacuum cleaner it's so handy just to unclip it off the wall and Hoover up I used to hate using my vacuum cleaner the wires getting caught all over the place I like to keep my floors clean so when there is a bit of dust on the floor I just unclip Hoover and back on the wall so handy so easy I do not live in a big massive house so the battery will last me a few days before having to charge it up again I can honestly say I now enjoy hoovering up oh my God what is wrong with me well that's what my partner says so I am considering buying my partner one of these vacuum cleaners I should have got one years ago and I doubt if I will ever go back to a corded vacuum cleaner is not the most powerfulest suction but is powerful enough to do carpets and laminated floors and the light on the front is so handy it lights up and show you where the dust is where you would not normally see it as I said before I just love this vacuum cleaner and for the price that you buy it for you cannot go wrong why get a unbelievably expensive vacuum cleaner that does the same job as this one I don't like calling it a cheaper version because it is such a good hoover take my advice if you want a not so expensive vacuum cleaner get this one trust me you will not be disappointed and it is a Hoover.so it is a good reliable make .Happy hoovering all you men out there .get them brownie point's from her indoors.the only thing I don't like is it takes so long to charge the battery up .but if you live in a small home then there is enough battery to do the job.but for a big home and it runs out of power .then you would have to wait a hour or so to wait for the battery to fully charge. If that was the case. Then it would be worth getting a 2nd battery.",
	"summary": "This lightweight vacuum cleaner is highly praised for its convenience and effectiveness. It provides sufficient suction for carpets and laminated floors, with a helpful front light. The long charging time is a downside, especially for larger homes. Consider purchasing a second battery. Overall, it's a reliable and affordable option."
},
{
	"review": "*EDIT - After months of use I still stick by my original review, however... I have a serious peeve with the filter. I've come to realise there is no way to empty this vacuum cleanly. Because the filter gathers hair and dust this clumps around the barrel and makes emptying the bin a messy ordeal. You have to remove the filter by hand when emptying the bin to ensure everything is out and end up with a hand that looks like it has been dipped in an urn! For that I've taken away 2 stars from my review.* Having previously owned two cordless Dysons I was looking for something different as I felt both had design flaws and weren't worth the hundreds of pounds price tags. Knowing Hoover to be a good old fashioned brand and reading multiple positive reviews I thought I'd take a chance as the price seemed very reasonable too. Well I'm glad I did! Much smoother than my Dysons, better suction, lightweight and I find I'm now happy to whip the vacuum around rather than getting frustrated at the lack of suction and constant up keep. The on board tools are also a huge bonus as I was getting fed up of being back and forth for the tools on my old model. Also love the little lights. Give it a go!",
	"summary": "This Hoover vacuum cleaner proves to be a worthwhile alternative to more expensive brands. It offers better suction, smoother operation, and convenient on-board tools. However, the filter design makes emptying the bin messy and requires manual removal. Overall, it's a good option at a reasonable price."
},
{
	"review": "Bought as a second vacuum to use in our motorhome. Suction is ok (not as good as maybe some of the more premium/expensive brands) but it meets our needs. It does get dog hair up which is good. Battery life is limited - we got approx 20/25 mins on first use so didn’t quite get finished before it needed a recharge. Takes a long time to recharge - approx 4 hours.",
	"summary": "This vacuum cleaner serves well as a secondary option for motorhome use. While the suction is decent, it falls short compared to pricier brands. It effectively removes dog hair, but the battery life is limited, requiring a recharge after 20-25 minutes. The lengthy 4-hour recharge time is a drawback."
},
{
	"review": "Poor suction and very short battery life (which takes about 8 hours to recharge!). Relatively cheap, so I guess I cannot complain. Feels flimsy and I don't expect it to last very long. It is light and easy to use though. Would be useless for pet hairs. I wouldn't buy again. Spend more and get better quality.",
	"summary": "This vacuum cleaner has poor suction, a short battery life, and a lengthy recharge time. It feels flimsy and lacks durability. However, it is lightweight and easy to use. Not recommended for pet hair. Consider investing in a higher-quality option."
},
{
	"review": "I bought this Hoover as I was finding my main Dyson cleaner rather unwieldy after suffering a broken ankle. It’s got great suction and charges in about six hours. The tools are a little limited, the crevice tool (stored in the underside of the unit) is handy, but rather too short for the gaps I need it for and the small brush is good for dusting off edges of furniture and the like. The main floor attachment is super for both carpet and hard floors, and I was pleasantly surprised how easily it picked up bits of fluff and hair. Some people might find the unit a little heavy using as a hand held on stairs, but overall it’s a great machine and well worth the money. I’ll probably still keep the Dyson for now, but I don’t think it’ll get used so often and this Hoover will be useful for vacuuming out the car too.",
	"summary": "This Hoover offers great suction and a reasonable charging time. The included tools are useful, although the crevice tool may be too short for some gaps. The main floor attachment works well on both carpet and hard floors. It's a bit heavy for handheld use on stairs, but overall it's a worthwhile machine with good value for money. It can also be used for vacuuming cars."
},
{
	"review": "Pleased with speed I can whizz around hoovering, very good suction, no hoover dust smell, although the dust compartment needs emptying of carpet fluff after 15 mins but I bought this to make hoovering stairs easier but it is unwieldy - I hold the bannister with one hand for safety and this hoover in the other but it is heavy for me and the large brush head isn't fixed so its movement and weight make the stairs less risk free than I wanted. The manual (dreadful) has little of help. It states charge for 24 hours before use - wonder how much energy that costs? My problem is it was easy to assemble the hoover stick and large brush on the end, but I can't dismantel them. I want to remove the large brush to make hoovering stairs easier, but nothing now comes apart despite clicking the release button and pulling as instructed. Any advice welcome please to save a return.",
	"summary": "The Hoover provides fast and efficient cleaning with good suction and no odor. However, the dust compartment fills up quickly, and using it on stairs can be difficult and heavy. The lack of clear instructions and inability to dismantle the brush head for easier use is frustrating. Seeking advice to avoid returning it."
},
{
	"review": "The suction is poor. More like a dust brush. Not picking up dirt from the floor. The accessories are a medium quality plastic. Not very durable but will not break on first use either. It is lightweight, easy to manover around. It is mice that has the accessories inside so you can carry them around. The battery is charged separately and it's fairly easy to store it. The hair will wrap around the brush ( if it happens to pick any as the suction is a bit rubbish) . Even with the tool attached will mot pick up small break crumble from first time. It is easy to empty the dust bin, but will not be that easy to wash it. From some thin carpets will pick up more, but for medium to thick carpets will stand no chance. A dust brush will do more. I sent it back to the seller. It says sold by Amazon, but actually is a company named Electrical Experience and their customer service is less than 1 star. I had a lot of trouble returning this. They even called be to tell me that this should be used as a second vaccum for easy jobs like stairs and things like this. Well nowhere is saying that on the description... Also I've been receiving a message from them that made no sense. 2 weeks to issue a lable and still waiting for a refund after 3 weeks of struggles. So be careful!",
	"summary": "The vacuum has poor suction, subpar accessories, and struggles to pick up dirt and hair. It is lightweight and easy to maneuver, but the battery is charged separately. Cleaning the dust bin is manageable, but the vacuum is not effective on thick carpets. Returning the product was a hassle due to poor customer service from the seller. Caution is advised."
},
{
	"review": "This product is nowhere near as good as it claims. 25 minutes of battery power is extremely optimistic. After 10 minutes there is a clear drop off in power. If you have a small flat it may be sufficient but expect to do 10 mins of cleaning followed by 6 hours of charging then another 10 mins of cleaning and repeat and repeat if you plan on cleaning a house. It also gets blocked extremely easily. We returned this and bought a Shark cleaner. There isn't a comparison the Shark picked up large amounts that this cleaner had missed. Dont waste your money on this buy something from another brand.",
	"summary": "The product falls short of its claims with optimistic battery life and a drop in power after 10 minutes. It's suitable for small spaces but requires frequent recharging and gets easily blocked. A Shark cleaner proved more effective. Consider alternatives from different brands."
},
{
	"review": "Well where do I start as there so much wrong with this hoover branded cordless. I’m firstly shocked that hoover allowed it to have its logo on such a poor vacuum. The design is bulky very top heavy for those who are elderly and the suction power is practically none existent I could suck in myself more powerfully and I’ve been on 20 year 20 pack a day habit. PThe 25 min run time I disagree it’s more like 15 and although dysons earlier models ran at 6mins on full power that was all that was needed due to the few passes needed to pick up large amounts dust/debris due to its suction power. I still own a dyson v59 animal but this had flaws with its bin splitting were you insert the tools so after my fifth bin at £21 a pop I saw this. I So wish I hadn’t. Unfortunately like the review I saw saying it was a free gift in return for a honest review I wish I had been given this luxury instead of parting with my hard earned money. The bin on this hoover is large as stated but still you have the problem of clicking the button and nothing falls out as it’s all wrapped and wedged between the inner bin and internal components but this will be after months of hoovering due to its poor pick up of dust/debris . My dyson with brush bar attachment lifts the pile of my carpet and same with the brush tool for stairs & soft furnishings you can see every pass I make but this hoover model just glides around you can feel no resistance as the suction is so weak and the pile remains flat. There’s no option to lower the brush bar or either a boost mode you get what it produces a whole lot of nothing-ness & the on board crevice tool that’s even a bigger joke it fits within the handle which you lift a clipped down cover which is fiddly to get out and hard to unlatch the lid. It is the shortest crevice tool I’ve seen the open end is so narrow a grain of rice would block up the crack I’ve never seen a crevice tool as small ,thin and the crack so narrow it is also useless to get down the sides of car seats as it’s too short once on the bulky head of the cleaner. Removing the long shaft to make it handheld for crumbs on work tops etc is not easy either and the slide down brush is stiff to get it to the end of the nozzle to use as handheld then this has a massive opening with thick bristles all around the outer edge and all the same length that when used it simply pushes the bits/crumbs/dust away on the floor with nothing actually getting sucked up. If you put your hand over to feel the suction power you will be so disappointed. It’s shocking why did I choose this model. I hope to make sure others don’t make the same mistake. My sister as just purchased a vax model with a plus-minus button on the handle for suction power & wow it’s better than dyson and even on the lowest bar of her vax cordless the suction is more powerful than this bulky useless hoover model. Do I need the hassle of returning no I will give it away to a local charity shop and hopefully after using this and reviewing it I can make other would be buyers more knowledgeable and hopefully choose a different brand. Please don’t waste your time & money on this cordless. I’ve tried uploading a few images one of which is the pathetic little crevice tool but for some reason I’m unable to see this option on my edit. Anyway I’ve measured my dyson crevice tool once clicked into the machine and it’s 21cm 8.5 inches in total this gets well into crevices like car seats etc.Now the crevice tool on this hoover 8cm 3.5 inches and the narrow crevice opening length of 1 inch compared to just under 2 inch on dyson with a much wider width enough for larger debris to suck into the bin and like I stated above a grain of rice would Block this crevice tool due to the narrow width.",
	"summary": "The Hoover cordless vacuum receives heavy criticism for its poor suction power, bulky design, and short battery life. The crevice tool is deemed useless, the bin is difficult to empty, and the overall performance falls far behind Dyson and other brands. Consider alternative options to avoid disappointment."
},
{
	"review": "Sad news I'm afraid. This little hoover is not good if you want clean floors. It is more of a carpet tickler than a vacuum cleaner. Suction is poor and greatly reduces over time. We have had ours 4 months and I'm giving up with it. Things quickly get blocked in its bendy tubes so there's a lot of trouble shooting and poking of sticks in to the tube to try and clear it before you can use it. Hoover helpline is helpful but I'd rather just have a vacuum that works with no fuss. The catch snapped on our dust bin but it's £26 to replace which is mad. I'm going to put that £26 towards a Shark because I know they work.",
	"summary": "The Hoover cordless vacuum disappoints with its weak suction, prone to blockages, and unreliable dust bin catch. Troubleshooting is frequent, and replacement parts are expensive. Consider investing in a more reliable brand like Shark."
},
{
	"review": "Even from the beginning I did not find the suction on this vacuum cleaner very good. It was fine on my hard floors, but on the stairs and on carpet the suction was not strong enough. After every clean I had to sit down with small scissors and cut away all the hair that had wrapped itself tightly around the roller in the head. Then after two years it stopped sucking the the head on so I thought the head must be damaged and tried to order that part. The part was not in stock so I waited for 2 months and then cancelled the order and bought a new vacuum cleaner. Very disappointing for such a well known brand!",
	"summary": "The Hoover vacuum cleaner lacks strong suction, particularly on stairs and carpets. Hair wrapping around the roller is a constant issue, and a malfunctioning head added to the frustration. Disappointing performance from a reputed brand."
},
{
	"review": "Lightweight, good suction, effective roller head, does a great job on our rugs. Picks up everything I'd expect a vacuum to collect. Comes with one extra HEPA filter; hopefully, cleaning the metal prefilter often will help the HEPAs last. Easy to assemble. Easy to recharge. Easy to empty. Easy to clear my hair off the roller, without taking anything apart so it doesn't matter that it lacks a 'hair wrap' feature. Headlight is surprisingly helpful. Also love that the vacuum will stand on its own at the side of the room, poised and ready. The height is a tad short for my 6-foot husband, except for doing the stairs, but it's fine for me. Ooh, wait--it does extend! Wonderful. Quiet, too, so we can use it late or early without waking anyone next door. I hope this lasts a long time!",
	"summary": "The lightweight Hoover vacuum offers good suction, effective roller head, and easy maintenance. It excels at picking up debris and includes helpful features like a headlight and self-standing design. The height may be a slight drawback for taller users. Overall, a quiet and promising vacuum."
},
{
	"review": "We have been using my father's old GTech Air ram for some time for the smaller jobs around the house particularly hoovering around the table and the rug, but needed something handheld to get up small accidents especially now we have a very inquisitive puppy, this does that and beyond it picks up her fur off the rug better than the gtech did and only problem is that it can get clogged easily but its easy to clear and charges well and does the job too.",
	"summary": "The handheld vacuum is great for small jobs and picking up pet fur. It outperforms the GTech Air Ram on rugs but can get clogged easily. Good charging and effective cleaning overall."
},
{
	"review": "The suction power is more sound then follow through. It does pick up most but definitely not all. It barely looks like I’ve vacuumed. I was disappointed, especially after reading the reviews. If you live alone with no pets and have either new carpets or hard surface flooring, then this is a great budget vacuum for you. Unfortunately, for everyone else, this is money that could have gone toward a more effective product. It’s just too bad that those brands cost so much. I should say, I was impressed with the battery life.",
	"summary": "The vacuum has moderate suction power but leaves behind noticeable dirt. It's suitable for single individuals without pets and new flooring. Battery life is good, but overall effectiveness is lacking."
},
{
	"review": "Glad I bought this but still need my old hoover.. Positives: 1.Easy to assemble, quick start 2. Lightweight and flattens out for under furniture cleaning 3. Once charged, battery power good for 30 mins. Great to not need plug in 4. Powerful on difficult to reach places, nooks and crannies Negatives: 1. Wood / flat floors only. Upright mode does not have suction power to vacuum carpets/rugs 2. Gets clogged up easily.. can’t cope with pet hair/fluff 3. Move from one level to another (eg, down a step) all dust spits out again whether switched on or off. 4. Have to empty frequently. (Twice per 30 mins standard clean).",
	"summary": "This vacuum is convenient and lightweight, but limited to cleaning wood or flat floors. It struggles with pet hair, gets easily clogged, and has issues with transitioning between surfaces."
},
{
	"review": "On full charge you need to have this on the highest power to pick up which means the charge runs out very quickly. I brought this for my mum with Parkinson’s thinking it would be ideal but unfortunately I have only just visited her so I’m over my return period otherwise it would have been going straight back!",
	"summary": "The vacuum's short battery life and weak suction on lower power settings make it inconvenient. Not suitable for users with specific needs, and missed the return window."
},
{
	"review": "Worst part is the charging time and usage on high speed. Charging time: almost 4hours (from zero) using the charger given in the box. Usage time (on full speed): 12 to 15 min MAX. Works ok on hard surface with single speed, however carpets needs max speed. Good fit for small area.",
	"summary": "The vacuum's long charging time and short usage time on high speed are major drawbacks. Works well on hard surfaces but requires maximum speed for carpets. Suitable for small areas."
},
{
	"review": "The vacuum is light so don’t expect a feeling of deep clean however I am very satisfied with the results and the handheld part is so good on the stair. One major thing to highlight the brush head is advertised as being motorised however after a couple of tries the brush only worked spasmodically. I emailed the company and within one day had a reply informing me that they were sending a replacement I was amazed and true to their word the new machine arrived in 3 days. Fantastic service I would recommend it.",
	"summary": "The vacuum is lightweight and performs well, especially the handheld part on stairs. However, the motorized brush head had issues, but the company provided excellent customer service by promptly replacing the machine. Recommended."
},
{
	"review": "Great upright lightweight hoover and good price. Suction power really good, plus lays flat when cleaning under furniture. Handheld section is also lightweight and bonus with the holder for the attachments that sits on the pole. I've only rated it 4 overall mainly because I do find I have to pull out all the hair from the vacuum head each use, to keep it working well. You also get a spare hepa filter with this. Battery life is pretty good, guess it depends how much time you spend vacuuming, but charges well. Overall would buy this again.",
	"summary": "Great lightweight hoover with strong suction power. Lays flat for cleaning under furniture. Handheld section and attachment holder are bonuses. Hair removal required, but comes with spare filter. Good battery life. 4/5 rating. Would buy again."
},
{
	"review": "First time using the Oraimo whilst setting up our Christmas tree. It doesn’t pick up all the pine needles first go, but it’s ok. I really like the handheld part. Very useful, light easy to connect/disconnect parts. Emptying is a one button release, t’s all very easy to use. After using for a month, I don’t think it’s powerful enough and it definitely doesn’t hold its charge for 45 mins on high suction, and it needs to be to get the job done. It’s a reasonable price - but I wish I had paid more for better suction.",
	"summary": "Oraimo vacuum is easy to use with a convenient handheld part and simple emptying. However, it struggles with picking up pine needles, lacks power, and doesn't hold a charge as long as claimed. Decent price, but better suction desired."
},
{
	"review": "Battery conked out after 30 minutes then tried to re charge , conked out after 5 minutes. They then sent me another battery so I thought thats great this one will work , worked for 20 minutes then conked out again and now won't re charge again. Would like to return but its too late now I think.",
	"summary": "Battery consistently fails, first lasting only 30 minutes, then 5 minutes after recharging. Replacement battery also failed after 20 minutes and won't recharge. Unhappy with return window."
},
{
	"review": "This review is about the replacement machine. Cleaned our carpets on normal suction very well. On this setting lasted long enough to do several rooms. There is two other settings. Turbo and low. Turbo for those difficult bits. Not really sure the low setting is for same as not sure what the blue tooth link is for as well. However the replacement machine certainly lives up to expectations. The extra tools make it very good for cleaning stairs or car interiors. Very pleased with this machine and found after sales went above and beyond. Would have given 5 stars if first one worked this well but from my experience this maker values its customers so would give them 5 stars.",
	"summary": "Replacement machine performs well on normal suction, lasts long enough for multiple room cleanings. Turbo setting for tough spots. Unsure about low setting and Bluetooth link. Excellent for stairs and car interiors. Satisfied with machine and exceptional after-sales support. 4/5 stars."
},
{
	"review": "Powerfull hoover with nice design. I really like that it comes withe wall mount holder so I fitted it to the wardrobe on the wall. Easy to clean with it perfect for small quick hoower up. The battery is more than enough for a 50 nm flat. I have a Henry for deep cleaning but they perfect mach to each other.",
	"summary": "Powerful hoover with stylish design. Convenient wall mount holder. Ideal for small quick cleanups. Sufficient battery for a 50 nm flat. Complements a Henry for deep cleaning."
},
{
	"review": "Love this vacuum. Everything about it just makes sense. It's lightweight and super maneuverable, the modularity is intuitive and simple, emptying and maintaining it is a breeze. The suction power isn't super strong and the battery doesn't last forever, but it's more than enough for cleaning up dusty rooms and small messes around the house. I really appreciate the storage wall bracket it comes with as well.",
	"summary": "Highly praised vacuum with intuitive design and lightweight maneuverability. Easy to empty and maintain. Moderate suction power and battery life, but sufficient for general cleaning. Includes storage wall bracket."
},
{
	"review": "This is one of those purchases that I never knew I needed in my life til I got it. How on earth did I spend hours lugging around a heavy tangled-wire Henry when I could’ve had this little piece of magic. Very impressed with how lightweight it is, perfect height so no back pain. I get the hoovering done in half the time it took with a Henry. The battery lasts around 60 mins which is as advertised, a good amount of time to hoover the whole house. This has been great at sucking up golden retriever dog hairs and getting in the nooks and crannies using the other attachments.",
	"summary": "Impressive lightweight vacuum that saves time and prevents back pain. Long-lasting battery allows for thorough cleaning. Effective in picking up pet hair and reaching difficult areas with attachments. A valuable and efficient purchase."
},
{
	"review": "The first time I bought this hoover I was worried that it would not be as powerful as a traditional hoover because it is cordless, but the first time I used it I had no problems at all, thanks to the fact that it is cordless it has an advantage over traditional hoovers when it comes to cleaning corners and it comes with several different heads for different scenarios. Lightweight in the hand and very easy to charge it comes with a charging base to pin it to the wall. All in all this is a very good hoover, if you want to buy a hoover choose this one and you won't regret it.",
	"summary": "Powerful cordless hoover with corner-cleaning advantage. Lightweight, easy to charge with a wall-mounted base. Versatile with multiple heads. Highly recommended as a reliable and regret-free purchase."
},
{
	"review": "I’ve coveted a cordless-bagless vac for ages and been hoping my old Miele would kink out on me. At last! Having done a fair bit of research I came across this cleaner I have 2 young children so clean up crumbs and mud daily with this and its great and I hardly ever use my corded vacuum anymore! I have a 3 bed house and it does the downstairs easily on one battery charge- it’s never gone lower than 60%. It has so far exceeded my expectations and is great on both carpet and vinyl floors. It is powerful with great suction and the battery lasts long than I expected even on highest suction power. It has good swivel action and the light is a great addition, easy to empty and charges quickly. I wouldn’t hesitate to recommend this vac and the price is great and a fraction of the cost of many others on the market.",
	"summary": "Long-awaited cordless bagless vacuum exceeds expectations. Great for daily cleanups with children, performs well on carpet and vinyl floors. Powerful suction, long-lasting battery, swivel action, and convenient features. Highly recommended at an affordable price."
},
{
	"review": "I have just only received this product and so far everything is perfect. The packaging is neat and well put together. OMG!! It's like a sports car!! It's soooo smooth and you think it's not picking anything up. But the motor and suction is so powerful that it is! The quality is supreme! As when are attaching and detaching various parts, there's a slight pressure then 'click'. This is indeed quality. Which ensures parts where they connect don't break over time with continued use. As opposed to my Morphy Richards Supervac Gold (which I am replacing this with) which in less than a year of occasional use broke with ease.In comparison with the the old one. The Horniture S13 is just like a Dyson Monster but better because it's much lighter (and in my signature colour Red) and my old Morphy Richards Supervac Gold is like a Black & Decker Dustbuster!",
	"summary": "Impressive packaging and smooth, powerful performance. High-quality build with secure attachments. Lighter and superior to previous vacuum. Comparable to a Dyson but better. Overall, a satisfying upgrade."
},
{
	"review": "I don't usually leave reviews but I'm so impressed with this hoover! This is my first cordless hoover, I have mobility issues and chronic pain and using our upright has become impossible so I thought I'd dive into modern life and give this cordless malarkey a shot! We hoovered with the upright on Sunday (now Wednesday) so I was expecting it to be a bit of a task for the cordless but I'm very pleasantly surprised at the power of this hoover. I have a human man, 6 year old very messy kid and a 4 legged fur ball kitty so this was mainly bought for crumbs and clean cat litter that the fur ball manages to get everywhere! Collected all the crap photographed before it ran out of battery, on full power around 30-40 mins which is a little frustrating but I planned on getting an extra battery anyway so no big deal. I also have quite a deep pile carpet and as most of these reviews mention hard floor I wasn't hopeful but I think the pictures show just how good it is! I was not expecing it to gather so much hair and fluff!! The light is awesome as it highlights all the crumbs and it didn't scare the living bejesus out of my cat which, considering its a noise she's not heard before (sounds different to the monster upright vax) is quite impressive. Anyway.. Buy this hoover, you will not be disappointed. Just have to edit to add how impressed I am after a few weeks,. Hoovering 3-4 times a week so it's not like this has built up, the amount of stuff this hoover picks up would legit rival Hoover's that cost 2 or 3 times what this one does, the battery power lasts plenty long enough and last 2 pics are taken afterhoovering just now even though it was yesterday as the child's room needed doing...that's just one room and then going over everywhere else to get anything I missed yesterday, absolute bargain!",
	"summary": "Impressive cordless hoover with powerful suction. Ideal for mobility issues and tackling crumbs and cat litter. Battery lasts around 30-40 mins. Effective on deep pile carpet and hard floors. Light feature is helpful. Great value for money."
},
{
	"review": "It's a good cordless vacuum suitable for smaller tasks versus a full household clean. The suction is okay, but not enough for a deep clean. I find I am always having to use the boost setting to get the best vacuuming, but this depletes battery very fast. You can also notice a definite noise change when the suction inexplicably and consistently reduces mid-vacuum after ~3 minutes. You can just turn off and turn on the hoover to get back to original suction (or better), but it is a slight annoyance. It is lightweight and easy to pull out and use. Perfect for quickly sucking up a toddler's meal leftovers or a spill. Overall, it's a good little workhorse that does the job it needs to do. Thank you Honiture. Here's hoping this hold up over time.",
	"summary": "Decent cordless vacuum for small tasks, lacking deep cleaning power. Boost setting drains battery quickly. Inexplicable suction reduction after 3 minutes, but easily fixed by restarting. Lightweight and convenient for quick cleanups. A reliable workhorse with room for improvement."
},
{
	"review": "The number of extremely positive reviews at the time of purchase was super shady, as they were almost entirely 5-stars for a brand I never heard of. Yes, it is lightweight. Yes, it is easy to use. However, if it can't do its primary function, it's not worth it. In terms of effectiveness, it's no better than my last £50 vacuum that I've had for 3 years. I'm still picking up hair after a person that left 1.5 months ago. If you see hair on the carpet, you can slowly go back and forth over it 20 times, then you'll bend over and go get it yourself. If you see a black thread from socks, you'll do the same. No matter what, this vacuum won't get it for you. I even tried picking it up and gently setting it down, then running over it. The vacuum flattened it back into the carpet. It has a really soft, wide brush which instead of picking things up, flattens them in. The only thing it can get is dust, but to be fair so can any vacuum.",
	"summary": "Questionable positive reviews, lightweight and easy to use. However, lacks effectiveness and struggles with hair and threads on carpets. Soft brush flattens instead of picking up debris. Limited to dust removal. Overall, disappointing performance compared to a previous affordable vacuum."
},
{
	"review": "I used this three times. First time: seemed okay. Suction not great on the lowest setting but the other two settings were fine. Didn’t run it long enough to have to worry about battery life. Second time: the trigger on/off button stopped being able to turn off the vacuum. Turning on was fine, but I had to remove the battery to turn it off. Again, didn’t run it long enough to worry about battery life. Third time: the trigger on/off button broke completely and the only way to turn on/off the vacuum was to take the battery in and out. The battery ran out when the screen showed 43% charge left.",
	"summary": "Mixed experience with the vacuum. Suction satisfactory on higher settings, but poor on lowest. On/off button malfunctioned, requiring battery removal. Limited battery life, with sudden drainage at 43% charge."
},
{
	"review": "The battery life goes down very quickly. It went down by 1% roughly every 10 seconds. It isn’t as good as picking up rubbish from a hard wood floor as much as my Henry Hoover. I’ll be returning this and taking my Henry out of the cupboard again. Shame really, as I really wanted to like this product.",
	"summary": "Disappointing battery life with rapid depletion. Inadequate performance on hardwood floors compared to a Henry Hoover. Returning and reverting back to Henry. Missed opportunity despite initial interest."
},
{
	"review": "Was considering the Shark or GTX but so glad I got this. Not only a far better price but really does the job ie cat hair. Powerful motor and sweeping action really cleans - the dust container was full. Can't believe so much was left in the carpet with my previous vacuum cleaner. A quick 40min charge is enough to do everything. Love the light weight/portability and the manouervability. Got to admit I'm a sucker (pun unintended) for flexibility so love how this can be configured for all cleaning jobs with the various tools and setups.",
	"summary": "Opted for a more affordable vacuum over Shark or GTX models. Impressive performance in removing cat hair and dirt, revealing a full dust container. Quick 40min charge sufficient. Lightweight, portable, and maneuverable. Versatile with multiple cleaning tools and configurations. A satisfying choice for flexible cleaning needs."
},
{
	"review": "Very impressive hoover, I personally would ignore the poor/negative reviews of this item, it works absolutely brilliant. Excellent vacuum power with a boost facility & brush facility when vacuuming carpets. We bought this to replace a Dyson that had a faulty brush facility & totally amazed at the amount of debris the vax removed that the Dyson had not picked up. Also very easy dissembling to clean. All in all 10 out of 10 to Vax for creating this little gem, far superior to Dyson.",
	"summary": "Highly impressive hoover with excellent vacuum power, boost facility, and effective brush feature for carpets. Outperformed a faulty Dyson, effectively removing debris. Easy disassembly for cleaning. A superior gem by Vax, surpassing Dyson. Perfect 10 out of 10."
},
{
	"review": "I should start off by saying I have never once in my life ever been excited for a vacuum cleaner or even impressed by one. However since buying this I can safely say that I have been quite astonished by it. Before I say how good this vacuum is, let me just give some context here: - Our old vacuum was a vax and it lasted years - Our old vacuum was also corded - We have a few pets in our house so there's lots of hair - Our house is 2 story so there's a lot of room to cover. With that out of the way, here's what I can say about this vacuum. I will start with the attachments. The attachments are amazing! Perfect tools for doing the right job such as: getting cobwebs out of the corner? Use the extension pole and the end with the brush and just simply remove them. Want to clean out the car? Well take off the extension pole and get the small motorised end piece and clean out the footwell with it. Lots of day to day mess on the floor? Put on the extension pole and use the normal end. This vaccine really is a jack of all traits because of the modular design of it that allows you to swap and change ends. Now I'm going to talk about the battery. There's not a lot to say about it because it's a battery but what I can say is that it has around 30-40 mins of use before it runs out and that 30-40 mins is more than enough time to get around a 2 story house. Its also just so convenient not having a cable pulling you back all the time aswell. The battery really gives you the freedom to move around with it everywhere. One of the features about this vacuum that I absolutely love is how easy it is to get pet hair out of the brushes on the bottom. Literally all you have to do is unscrew the barrel for the brush using a coin, pull it out, run some scissors down the fluted part of the barrel and then pull the hair off of the brush. It's literally that simple. Also when it comes to dumping the dirty out and into the bin, it's so effortless. Just unclip the chamber and then put it over a bin and then dump it. On average use I have to do this around twice per clean in the house. In summary, this vacuum is seriously one of the best ones I've ever seen. Sounds weird to be excited over one but it seriously is amazing. If you're looking for a vacuum, this is the one to go for.",
	"summary": "Surprisingly impressive vacuum with versatile attachments and easy maintenance. Battery lasts 30-40 minutes, sufficient for a 2-story house. Effortless hair removal from brushes and easy dirt disposal. Highly recommended choice."
},
{
	"review": "I bought this and was so happy with it as it made life very much easier. HOWEVER, after two weeks of use in a one-person, one-cat household....it broke!!! The lights came on but it suddenly didn't work. I had registered it to be guaranteed but when I contacted Vax they said I was not on the system. I emailed them a copy of my 3-year guarantee I had received from Vax. They arranged for the pickup of the vacuum and returned a new one within 5 days. I suppose, even though disappointed I can't complain too much. A little maybe but not worth bothering about here. My advice is keep the box (I didn't because I was sure a Vax wouldn't break down and had no room to store it) also register asap and keep your guarantee safe as safe can be. I'm vacuuming away happily at the moment and just hope it lasts this time!",
	"summary": "Initially satisfied with the vacuum but encountered a malfunction after two weeks. Customer service resolved the issue by replacing it promptly. Advice to keep the box and register for warranty."
},
{
	"review": "Good value overall as cheaper don't last and you could pay the earth for something similar. Not as light as hoped for the better half. Battery life ok for average property. Powerfull enough too. I would have bought more expensive model but it was obvious it didn't charge while being stored. I hoped this model did as it wasn't clear to me at least in video or description: is that deliberate? Needs a design tweek to sort that one.",
	"summary": "The vacuum offers good value and sufficient power, but it is not as lightweight as desired. Battery life is adequate, but unclear if it charges while stored. Requires design improvement."
},
{
	"review": "The first one only lasted a few months, but VAX replaced it without a hassle. While it is cordless, it's not weightless! Kind of a beast to use, actually. It won't stand up on its own, so unless you bolt the stand onto the wall, it will flop over as the battery makes it very top heavy. The most frustrating thing, by far, is the container for the dirt. It fills quickly, so we know it's working well, but emptying it is a real chore. You have to get your fingers or a small stick to pull out the matted up dirt, pet hair, etc. and it needs emptying several times during use. I'd like to talk to the person who invented the container....I'll bet he/she had never really used it! We only have a small bungalow, one old dog, and no children, so I would expect it to be a bit more practical. I don't think we'll ever get this one again if it fails again.",
	"summary": "VAX replaced the vacuum quickly, but it's heavy and won't stand on its own. The dirt container fills up fast and is difficult to empty. Not practical for a small household. Unlikely to repurchase."
},
{
	"review": "I've got a jack Russell and as anyone who knows they put Caine confetti EVERYWHERE!!. This hoover don't hoover up to edges or anywhere near bit of a pain. It's also not great on dried mud trampled in by kids on wooden floors it moves it around and chucks it behind it so you think you've got it till you turn round. Some would say it's lightweight but it is top heavy. Where it cleans on carpet it is very good. Again with the jack fluff it's a pain to empty as it all sticks up around the mesh filter thing and the gap is too tight to get your fingers up in so you've got to take it apart from the other end A messy job do it outside. I'm only a week in with this thing and let's just say I wouldn't buy another and will just use it as a quick whip round thing. Henry will come out once a week for a good clean",
	"summary": "The vacuum struggles with edges and dried mud on wooden floors, but performs well on carpets. It is lightweight but top-heavy. Emptying the dust container is difficult and messy. Overall, not recommended for thorough cleaning."
},
{
	"review": "I was really excited to try this vax hoover as I have the hard floor cleaner and can swap the batteries around. However if you're disabled or weak or elderly you're going to find this a struggle. The dust bucket is at the top and so is the battery and it's really heavy when it's all put together. The brush part is quite small and so easier to handle. You can separate it and use it as a handheld with attachments but it's still heavy for me. I thought the attachments were made from low quality plastic too. Also there is a bracket for the wall that needs screwing in and you have no choice but to use it. The hoover won't stand up on its own as it just falls over as soon as you let go. This is the worst bit and could easily fall over on your baby or dog. My son has hollow walls to and isn't allowed to screw anything into the wall. So if my walls were like that I'd have nowhere to keep this. The suction is good I've got no issues there but it's the rest of it unfortunately. It's a let down compared to the hard floor cleaner. If I had paid almost two hundred pounds for this I would have returned as it's just not suitable. I have parents in the annexe and we share appliances. My mother has arthritis and she just can't use this. I thought manufacturers were trying to be more inclusive but this does a rewind back many years. I've only given it three stars for the suction and it loses two stars on account that I can't use the thing.",
	"summary": "The Vax Hoover is heavy, especially when fully assembled, making it difficult for disabled or elderly individuals to use. The dust bucket and battery placement at the top adds to the weight. The attachments are made of low-quality plastic, and the required wall bracket is inconvenient. It lacks stability and falls over easily. While the suction is good, overall usability is disappointing, especially considering the price."
},
{
	"review": "I have had an older model cordless Vax & a cordless Dyson so it’s good to compare as well as review. The good thing about this model is that you have all the attachments you could need as standard. No need to purchase separately. The light on the brush bar only works when the brush is rotating. The instructions tell you that on hard floors, to not use the brush function so when vacuuming most of our home, the light function is not on as it’s stone or wood flooring. When vacuuming with the brush function off, I found that all the dog hair I was collecting stayed in the floor head & did not travel to the dirt collector. I had to use the brush function to get it to reach the canister. I found this odd as it called a Pace Pet. As in the title, the dirt canister is small. From the bottom to the max sign is only 4.5 cm compared to 7.5 cm on my Dyson. When you have large hairy dogs, even when vacuuming every day, it needs emptying very quickly. If you have a longer piled rug, the brush function stops. It doesn’t like a shag pile. One of the biggest problems on my old Vax was that the hose that leads from the floor brush to the reach wand would split after about 6 months of use. It doesn’t have a solid “elbow” joint, but a flexible plastic tube. I had hoped that this would have been updated, but it looks the same. I hope perhaps the material has been amended so that it doesn’t split. Having to buy a new floor head every 6 months can be expense that is not factored in when buying a new vacuum. The advantage over the Dyson is that you don’t have to keep your finger on the “On” switch. Price wise, it’s not too bad for a cordless especially when according to the blurb, the battery can be used with other Vax products (not that I have any at the moment). To sum up, if you have a lot of hard floors & dogs that shed a lot of hair, this isn’t the best, however, for a home that is mostly carpeted & maybe a cat or two, it will do the job.",
	"summary": "The Vax Pace Pet cordless vacuum comes with useful attachments, but the light on the brush bar only works when it's rotating. The small dirt canister fills up quickly, especially with pet hair. It struggles with longer piled rugs and has a potential issue with the hose splitting. However, it offers the advantage of not needing to keep the 'On' switch pressed and is reasonably priced for a cordless option. It may be suitable for mostly carpeted homes with minimal pet hair."
},
{
	"review": "When I first put this together out of the box and charged it up I was pleased at how lightweight it was. It’s easy to handle and for anyone who struggles to hold heavier objects, that’s a real bonus. On turning it on I was surprised again at how little noise it really made. It is quiet but I immediately felt it was quite anaemic and underpowered. It actually picks up ok, it’s not bad but if there was a lot of mess to pick up I’d not use this. We tend to use it for little spills and accidents, leaving the main cleaning to the other cleaners we have for the house and car. This is not bad, but I’d not use it for the whole house.",
	"summary": "The Vax cordless vacuum is lightweight and easy to handle, making it suitable for those who struggle with heavier objects. It operates quietly but lacks power, making it more suitable for small spills and quick cleanups rather than extensive cleaning."
},
{
	"review": "Bought this hoover last October as the wife wanted cordless instead of wired, great little hoover, easy to use, it’s been okay until up to a couple of weeks ago, when the battery wouldn’t charge, read lots of reviews how batteries had stopped after only a few months, so purchased a new battery, which aren’t cheap, that wouldn’t charge, so had to be the charger itself, now had to buy a another charger, batteries are charging again, put a 2 star rating as hoover is good, but you think having to pay just under two hundred pounds the accessories would last longer, but not to have too spend nearly another one hundred pounds to keep it going, pretty poor show Vax.",
	"summary": "The cordless Vax vacuum is easy to use and initially worked well, but encountered issues with the battery and charger. Replacement parts were required, resulting in additional expenses, which affected the overall satisfaction with the product."
},
{
	"review": "When our cylinder Dyson gave up after 13 years we decided to try this a battery model. We have two ragdoll cats which means lots of fluff so we got the pet model. Very disappointed, the suction is miserable, it just manged to cope with our varnished floorboards but struggled with anything bigger than just a small bit of grit. On carpets it was all but useless, it would have been faster and more effective to go over them with a lint roller. I've just printed off a return label and I'm we're about to look at the options for another cylinder model instead...",
	"summary": "The cordless Vax pet model was a disappointment with weak suction and poor performance on both floors and carpets. Returning the product and considering a different cylinder model instead."
},
{
	"review": "I bought this vacuum over about 18 months ago and both batteries have died and won't recharge. This was just out of the Warranty time so I have no come back and if I want to use it I would have to pay £50 for a new battery. I decided to get myself a shark cordless vacuum and haven't looked back. It was a good vacuum until the batteries died.",
	"summary": "The vacuum worked well initially, but both batteries died just after the warranty period. Replacement batteries were expensive, so the reviewer switched to a Shark cordless vacuum."
},
{
	"review": "The suction power is poor especially when near edges of walls and furniture. They have a brush tool provided but the suction is even poorer when that is used. If you have it on boost power the battery on mine lasts about 8 minutes. When you vacuum a room and have to move something to get under it. The vacuum will inevitably fall to the floor constantly as it has difficulty standing up unless put in to the bracket given for you to screw on wall. We find it awkward to use. The wife wants me to buy another brand as she is really not keen on this one.",
	"summary": "The vacuum has poor suction, especially near edges and when using the brush tool. Battery life is short on boost power. It falls over easily and is awkward to use. Consider buying a different brand."
},
{
	"review": "I bought this hoover as I need to combat my German Shepherds hair/fur drop. I purposely borrow this as its advertised as a 'Pet Pro!'. As it turns out I had nothing to fear!! It's very good at picking up hair, at least 3 times a day. I'm constantly keeping it on charge to keep the battery on full charge but this is moreso to make sure that its ready to use. Well worth the money. Would highly recommend. As a certain brand called Dy--n is at least 4 times as costly!!!",
	"summary": "This vacuum is highly effective at picking up pet hair, even requiring multiple uses per day. The battery needs frequent charging, but overall it's a worthwhile purchase compared to more expensive brands."
},
{
	"review": "There’s a lot to like with this cordless 3-in-1 vacuum cleaner. It is very well-made, feels robust and looks gorgeous. It is light, easy to use, doesn’t take up a lot of room and can be wall-mounted, if you want it to be. It is versatile and can be used as a full-length vacuum, with just the pole, or reduced to a useful hand-held size. It comes with the tools that you would expect, and they are very easy to swap in and swap out. It’s easy to empty and the filter is washable, which is a bonus. In terms of power, it’s not the most powerful vacuum, but given what it is and the size of the motor, you shouldn’t expect it to be, and it is perfectly adequate. If you live in a reasonably sized house, with thick carpets, lots of people/children/pets in and out all day, and this is your only vacuum, my gut feeling is that it’s going to struggle to meet your demands, and it would be better to have a different vacuum for deep cleaning and this one for day-to-day as and when. If you have lots non-carpeted areas, I think this would be fine. I used it to cover a specified area and then went over the area again with my main vacuum; the main vacuum did pick up a few extra bits, but it was negligible, and less than I expected it to be.",
	"summary": "This cordless 3-in-1 vacuum cleaner is well-made, versatile, and easy to use. While it may not be the most powerful option, it is suitable for day-to-day cleaning and non-carpeted areas."
},
{
	"review": "This is a nice cordless vacuum at an affordable price. Very affordable and that comes with some compromises. Starting with the Cons, I need to say that the suction is not as good as I was hoping for. Is not doing great on carpets but is way better on hard floors. Collects hair easily as promised but mostly from the hard floor. On the carpet is harder. Especially carpets with long piles. It is a bit noisy (noisier than the one I have now) but nothing dramatic. The battery doesn't really last long but is already stated that it runs only for 35 minutes. That is because the battery is small and this is one of the main reasons this vacuum is so light. The compartment for the dust and bits is small too but this also reflects on the overall weight of the vacuum. Now as for the pros, it has a beautiful style. Aesthetically is very nice. Extremely light (because of the small battery) you can hold it with one hand and clean high ceilings, corners, spider webs, etc, without getting tired or sore arms. For someone who has less strength in arms is ideal. Comes with many accessories that can change easily and make this vacuum from a long one for floors to a small handheld one for your car or couch or just for that moment that something fell on the floor. It is something you can have handy without the need for loads of space. The filter is very good and washable so that helps a lot. The system is truly anti-tangle for hair and that is very good. Except for the head accessories, It comes of course with a base to mount on the wall (although not really essential) and its charger. You set it up extremely easily and you can change the parts easily as well. Is just a click. Overall this is a friendly budget vacuum that is to be used as secondary and for daily maintenance, especially with pets, and not for deep cleaning. This can be your second 'cheap and light' when you don't want out to take out the big one just for refreshment and maintenance.",
	"summary": "This affordable cordless vacuum has some compromises. It lacks strong suction on carpets but performs better on hard floors. The battery life is limited, but it's lightweight, aesthetically pleasing, and comes with various accessories for versatile use. It's ideal for quick maintenance and secondary cleaning tasks."
},
{
	"review": "It’s early days yet, but so far this is a decent replacement for our little handheld. It’s pretty light so much so that our 5yo can use it pretty comfortably, which I’m not gonna lie is pretty handy. I’m not sure the price tag of £109 is quite right, as things do feel a little basic. The hoover has 2 power settings, the long pole and power head attachment have led lights to help highlight your way to a tidy house. The power head has a fuzzy roller rather than the typical spiral brush which is a little odd, but it still works. These a clip that comes in the box to attach the multi reach tools direct onto the main pole. In all a handy light weight quick whip around, but don’t expect it to be as good as your main squeeze.",
	"summary": "This lightweight cordless vacuum is a decent replacement for a handheld. It's easy to use, even for a child, and has LED lights for visibility. The power head has a unique roller design. It's suitable for quick cleanups but falls short compared to a full-size vacuum."
},
{
	"review": "I'm quite impressed with this vacuum. I also have a Dyson so of course I had to compare it to that. They are actually pretty similar, the biggest difference between them is just that this doesn't have a trigger. There is a button on the back that you press once to turn on, again for high power mode and again to turn off. Everything else is so similar to the Dyson that I wonder why they didn't add the trigger, maybe due to patents or something? It has many of the same features such as being easy to see how much has been collected in it and being easy to empty. It also looks really nice with a very appealing colour scheme and has plenty of accessories. My only concern would be the power, it's not quite as powerful as the Dyson but it doesn't feel far off, neither of them compare to a corded vacuum in terms of raw suction power. We are now using this one upstairs and the other one downstairs.",
	"summary": "This vacuum is impressive and comparable to a Dyson. It lacks a trigger but has similar features, including easy visibility of collected dirt, easy emptying, and a pleasing design. The power is slightly less than a Dyson but still effective. It's suitable for different floors."
},
{
	"review": "Unfortunately this seems to badly lack power for vacuuming carpets. It will do for a quick clean up but I wouldn’t recommend it as a replacement for a corded vacuum cleaner. On hard floors it’s more than adequate and the brush roller does a good job of pulling in dust and debris where it can easily pick it up. The roller doesn’t flick debris behind the unit which is something I have dealt with frequently using smaller vacuum cleaners. For hard floors only, this is perfect. The attachments are good enough for cleaning sofas(pet turbo attachment) and corners with the limited suction it has. All in all I would say this is pretty much perfect for say a caravan or hard floors only. It works on carpets but doesn’t get deep enough into the carpet and the suction isn’t strong enough to work effectively.",
	"summary": "This vacuum is suitable for hard floors but lacks power for carpets. It's great for quick clean-ups and has good attachments, but not recommended as a corded vacuum replacement. Ideal for caravans or hard floors only."
},
{
	"review": "The build quality of this cordless vacuum cleaner is better than I was expecting. I have a steam mop from this make and it’s a bit rickety-feeling. This, however, seems sturdy enough and made from fairly chunky, solid-feeling plastic, with the exception of the covers for the dust container and filter, which do feel a little thin. At less than 2.4kg, it’s nice and light and easy to move round the house. I’m not overly keen on the colour combination - which isn’t blue and gold as titled, but blue and ROSE gold. There is definitely a pink tone to it. Although the product images make the main tube look lighter and silvery, in fact this too is rose gold. The vacuum collects dust into a smallish dust container built into the handle. The container opens and empties directly downwards, when a catch holding the container lid shut is released. The controls are straightforward, though I find the positioning and small size of the power button on the handle a bit awkward, and the handle itself could be more comfortable. I find the shaping of the handle pushes my hand down onto the blocky, hard-shaped battery holder. This is OK in use, but less powerful than other vacuums we own, and the motor seems quite whiny. We have a long-haired mini dachshund who sheds lots of tiny, fine red hairs and this wasn’t particularly good at getting these out of the carpet. The HEPA 13 filter needs to be cleaned and washed regularly, and to ensure that it’s fully dry and dust doesn’t get stuck to damp surfaces clogging it, this needs to be left for 24 hours after washing. Other vacuums require similar timeframes, but you can usually get a spare filter so that you’re not without your hoover for a full day - at time of writing nothing seems to be available for this model. The vacuum comes with a single 22.2v battery. This requires a 4-5 hour charge (the manual says 4 hours, the manufacturer website 4-5) for a maximum 35 minute run time. Unless I was doing a very cursory sweep over the middle of our floors just to freshen things up a bit, this run time isn’t long enough to get round our house in one go and 4-5 hours is quite long to wait for the battery to recharge. I had a look for spares availability, but at time of writing I can’t find any sign of spare batteries for this model even on the manufacturer’s website. The battery is separate from the machine rather than built in to it, and the battery can be removed to charge. The manual is somewhat confusing on this point, as it talks about “the unit” being able to be charged directly from the mains. However, the charging point is in the removable battery, rather than built in to the vacuum itself and the battery charges perfectly well when not attached to the vacuum (there are three little blue LED charge status indicator lights on the side of the battery. This is handy: since the battery can be removed for charging there’s no need for the wall mount for the machine to be near a plug socket, so if e.g. you wanted to put this out of the way on the wall in a cupboard with no plug points, this is fine. Something I wasn’t at all impressed by was the fact that this was marked in several places, even though it’s a brand new vacuum with every single piece separately wrapped in plastic. As soon as I got it out of its packet, I could see that there were little scrapes all over the battery, including long scuffs on the underside that make it look as though it had been repeatedly put in and out of a holder. I think on the whole this is an OK vacuum at the price point. It could be more powerful, and it’s annoying that run time can’t be extended with a second battery. The handle could be more comfortable. This is fairly inexpensive at £109 for a newly-released, branded cordless vacuum, but isn’t as good as similar devices by Karcher, Vax, GTech, or Levoit. Comes with a 1-year warranty as standard, extendable to 3 years via online registration. Pros: lightweight, Generally sturdy build, Easy to use, Battery can be charged separately, Up to 3 years warranty. Cons: Not as powerful as others, Several marks on the one I received, Currently no sign of spares for battery/filter, so long waits are needed for charging/drying time.",
	"summary": "This cordless vacuum cleaner has a sturdy build and is lightweight. However, it lacks power compared to other brands and has several marks upon arrival. Battery and filter spares are not readily available. Warranty can be extended to 3 years."
}
]